In [2]:
import pandas as pd
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_transactions = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [3]:
df_transactions

  Card Number       Date  Transactions  Amount
0       CN012 2019-09-01             2  356.20
1       CN014 2019-09-01             3  120.50
2       CN015 2019-09-01             1   53.23
3       CN016 2019-09-01             3   25.60
4       CN012 2019-09-02             5  785.00
5       CN015 2019-09-02             2   23.12
6       CN016 2019-09-02             3   28.30
7       CN012 2019-09-03             4   36.90
8       CN014 2019-09-03             2   23.60
9       CN016 2019-09-03             4   43.50

In [5]:
df_transactions.pivot(index='Card Number', columns='Date', values=['Transactions', 'Amount'])

            Transactions                           Amount             \
Date          2019-09-01 2019-09-02 2019-09-03 2019-09-01 2019-09-02
Card Number
CN012                2.0        5.0        4.0     356.20     785.00
CN014                3.0        NaN        2.0     120.50        NaN
CN015                1.0        2.0        NaN      53.23      23.12
CN016                3.0        3.0        4.0      25.60      28.30


Date        2019-09-03
Card Number
CN012             36.9
CN014             23.6
CN015              NaN
CN016             43.5

In [7]:
df_transactions.pivot(index='Card Number', columns='Date', values=['Transactions'])

            Transactions
Date          2019-09-01 2019-09-02 2019-09-03
Card Number
CN012                2.0        5.0        4.0
CN014                3.0        NaN        2.0
CN015                1.0        2.0        NaN
CN016                3.0        3.0        4.0

In [8]:
df_transactions[:4].melt(id_vars = ['Card Number', 'Date'] , value_vars= ['Amount',
'Transactions'] )

  Card Number       Date      variable   value
0       CN012 2019-09-01        Amount  356.20
1       CN014 2019-09-01        Amount  120.50
2       CN015 2019-09-01        Amount   53.23
3       CN016 2019-09-01        Amount   25.60
4       CN012 2019-09-01  Transactions    2.00
5       CN014 2019-09-01  Transactions    3.00
6       CN015 2019-09-01  Transactions    1.00
7       CN016 2019-09-01  Transactions    3.00